; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj5 obj14 - airport
	obj1 obj6 - city
	obj2 obj4 obj8 obj9 obj11 obj15 obj16 - package
	obj3 - location
	obj7 obj10 obj13 - truck
	obj12 - airplane
)

(:init
	(in-city obj5 obj6)
	(in-city obj0 obj1)
	(at obj8 obj3)
	(at obj11 obj5)
	(at obj12 obj5)
	(at obj16 obj0)
	(at obj4 obj0)
	(at obj7 obj3)
	(in-city obj14 obj6)
	(at obj15 obj3)
	(in-city obj3 obj1)
	(at obj9 obj3)
	(at obj2 obj0)
	(at obj10 obj5)
	(at obj13 obj5)
)

(:goal (and
	(at obj9 obj0)
	(at obj11 obj5)
	(at obj8 obj0)
	(at obj2 obj14)
	(at obj15 obj0)
))
)

; plan
1. (load obj7 obj9 obj3)
   deleted: (at obj9 obj3)
   added: (in obj9 obj7)
   goals met: 1 of 5
2. (load obj7 obj8 obj3)
   deleted: (at obj8 obj3)
   added: (in obj8 obj7)
   goals met: 1 of 5
3. (load obj7 obj15 obj3)
   deleted: (at obj15 obj3)
   added: (in obj15 obj7)
   goals met: 1 of 5
4. (drive obj7 obj3 obj0)
   deleted: (at obj7 obj3)
   added: (at obj7 obj0)
   goals met: 1 of 5
5. (unload obj7 obj9 obj0)
   deleted: (in obj9 obj7)
   added: (at obj9 obj0)
   goals met: 2 of 5
6. (unload obj7 obj8 obj0)
   deleted: (in obj8 obj7)
   added: (at obj8 obj0)
   goals met: 3 of 5
7. (unload obj7 obj15 obj0)
   deleted: (in obj15 obj7)
   added: (at obj15 obj0)
   goals met: 4 of 5
8. (fly obj12 obj5 obj0)
   deleted: (at obj12 obj5)
   added: (at obj12 obj0)
   goals met: 4 of 5
9. (load obj12 obj2 obj0)
   deleted: (at obj2 obj0)
   added: (in obj2 obj12)
   goals met: 4 of 5
10. (fly obj12 obj0 obj14)
   deleted: (at obj12 obj0)
   added: (at obj12 obj14)
   goals met: 4 of 5
11. (unload obj12 obj2 obj14)
   deleted: (in obj2 obj12)
   added: (at obj2 obj14)
   goals met: 5 of 5
